app/controllers/endangered_controller.rb

SELECT "endangereds".* FROM "endangereds"
---
    def set_endangered
      @endangered = Endangered.all